readme.org
#+TITLE: Project Euler Solutions
#+OPTIONS: toc:nil

* Project Euler Solutions
:PROPERTIES:
:UNNUMBERED: notoc
:END:

* Overview
I have begun working to solve the programming problems of [[https://projecteuler.net][Project
Euler]]. My solutions are available in this repository. I use a variety
of languages; there are language specific folders in each problem
folder. This will be an ongoing project and the readme may be updated
or extended in the future.

Please note that this repository is intended to be part of a portfolio
to show my work as a programmer. Do not use or examine my solutions if
you intend to do the Project Euler problems yourself. I understand that
making solutions available for problems beyond problem 100 is
discouraged, so I may choose to limit this public repository to
problems 1 thru 100.
